[Killed] BlockStatement
src/componentes/Formulario.tsx:17:81
 
     const mensagemDeErro = useMensagemDeErro()
 
-    const adicionarParticipante = (evento: React.FormEvent<HTMLFormElement>) => {
-        evento.preventDefault()
-        adicionarNaLista(nome)
-        setNome('')
-        inputRef.current?.focus()
-    }
+    const adicionarParticipante = (evento: React.FormEvent<HTMLFormElement>) => {}
 
     return (<form onSubmit={adicionarParticipante}>
killedBy: o comportamento do Formulario.tsx adicionar um participante caso exista um nome preenchido
statusReason: Error: expect(element).toHaveFocus()

Expected element with focus:
  <input placeholder="Insira os nomes dos participantes" type="text" value="Ana Catarina" />
Received element with focus:
  <body><div><form><div class="grupo-input-btn"><input placeholder="Insira os nomes dos participantes" type="text" value="Ana Catarina" /><button>Adicionar</button></div></form></div></body>

[Killed] ArrowFunction
src/componentes/Formulario.tsx:29:27
             <input
                 ref={inputRef}
                 value={nome}
-                onChange={evento => setNome(evento.target.value)}
+                onChange={() => undefined}
                 type="text"
                 placeholder="Insira os nomes dos participantes"
killedBy: o comportamento do Formulario.tsx adicionar um participante caso exista um nome preenchido
statusReason: Error: expect(element).toHaveFocus()

Expected element with focus:
  <input placeholder="Insira os nomes dos participantes" type="text" value="" />
Received element with focus:
  <body><div><form><div class="grupo-input-btn"><input placeholder="Insira os nomes dos participantes" type="text" value="" /><button disabled="">Adicionar</button></div></form></div></body>

[Killed] LogicalOperator
src/componentes/Formulario.tsx:35:10
             />
             <button disabled={!nome}>Adicionar</button>
         </div>
-        {mensagemDeErro && <p className="alerta erro" role="alert">{mensagemDeErro}</p>}
+        {mensagemDeErro || <p className="alerta erro" role="alert">{mensagemDeErro}</p>}
     </form>)
 }
killedBy: o comportamento do Formulario.tsx nomes duplicados não podem ser adicionados na lista
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  textbox:

  Name "":
  <input

[Killed] ConditionalExpression
src/componentes/Formulario.tsx:35:10
             />
             <button disabled={!nome}>Adicionar</button>
         </div>
-        {mensagemDeErro && <p className="alerta erro" role="alert">{mensagemDeErro}</p>}
+        {false}
     </form>)
 }
killedBy: o comportamento do Formulario.tsx nomes duplicados não podem ser adicionados na lista
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  textbox:

  Name "":
  <input
