[Killed] ArrowFunction
src/componentes/ListaParticipantes.tsx:8:32
     const participantes: string[] = useListaDeParticipantes()
     return (
         <ul>
-            {participantes.map(participante => <li key={participante}>{participante}</li>)}
+            {participantes.map(() => undefined)}
         </ul>
     )
killedBy: uma lista preenchida de participantes deve ser renderizada sem elementos
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []
