[Killed] BlockStatement
src/componentes/Rodape.tsx:15:27
 
     const sortear = useSorteador()
     
-    const iniciar = () => {
-        sortear()
-        navegarPara('/sorteio')
-    }
+    const iniciar = () => {}
 
     return (<footer className="rodape-configuracoes">
killedBy: quando existem participantes suficientes a brincadeira foi iniciada
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/componentes/Rodape.tsx:21:45
     }
 
     return (<footer className="rodape-configuracoes">
-        <button className="botao" disabled={participantes.length < 3} onClick={iniciar}>Iniciar brincadeira</button>
+        <button className="botao" disabled={false} onClick={iniciar}>Iniciar brincadeira</button>
         <img src="/imagens/sacolas.png" alt="Sacolas de compras" />
     </footer>)
killedBy: quando não existem participantes suficientes a brincadeira não pode ser iniciada
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <button class="botao" />

[Killed] EqualityOperator
src/componentes/Rodape.tsx:21:45
     }
 
     return (<footer className="rodape-configuracoes">
-        <button className="botao" disabled={participantes.length < 3} onClick={iniciar}>Iniciar brincadeira</button>
+        <button className="botao" disabled={participantes.length <= 3} onClick={iniciar}>Iniciar brincadeira</button>
         <img src="/imagens/sacolas.png" alt="Sacolas de compras" />
     </footer>)
killedBy: quando existem participantes suficientes a brincadeira pode ser iniciada
statusReason: Error: expect(element).not.toBeDisabled()

Received element is disabled:
  <button class="botao" disabled="" />
