[Killed] BlockStatement
src/componentes/Calculadora/Calculadora.tsx:1:46
-export function divide(a: number, b: number) {
-  return a / b;
-}
+export function divide(a: number, b: number) {}
killedBy: divida 6 por 3 dividing 6 by 3 equals 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
src/componentes/Calculadora/Calculadora.tsx:2:10
 export function divide(a: number, b: number) {
-  return a / b;
+  return a * b;
 }
killedBy: divida 6 por 3 dividing 6 by 3 equals 2
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 18
