[Survived] StringLiteral
src/paginas/Sorteio.tsx:13:64
 
     const participantes = useListaDeParticipantes()
 
-    const [participanteDaVez, setParticipanteDaVez] = useState('')
+    const [participanteDaVez, setParticipanteDaVez] = useState("Stryker was here!")
     const [amigoScreto, setAmigoSecreto] = useState('')
 

[Killed] BlockStatement
src/paginas/Sorteio.tsx:18:67
 
     const resultado = useResultadoSorteio()
 
-    const sortear = (evento: React.FormEvent<HTMLFormElement>) => {
-        evento.preventDefault()
-        if (resultado.has(participanteDaVez)) {
-            setAmigoSecreto(resultado.get(participanteDaVez)!)
-        }
-    }
+    const sortear = (evento: React.FormEvent<HTMLFormElement>) => {}
 
     return (<Card>
killedBy: na pagina de sorteio o amigo secreto é exibido quando solicitado
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  heading:

  Name "Quem vai tirar o papelzinho?":
  <h2 />

[Killed] ConditionalExpression
src/paginas/Sorteio.tsx:20:13
 
     const sortear = (evento: React.FormEvent<HTMLFormElement>) => {
         evento.preventDefault()
-        if (resultado.has(participanteDaVez)) {
+        if (false) {
             setAmigoSecreto(resultado.get(participanteDaVez)!)
         }
killedBy: na pagina de sorteio o amigo secreto é exibido quando solicitado
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  heading:

  Name "Quem vai tirar o papelzinho?":
  <h2 />

[Killed] BlockStatement
src/paginas/Sorteio.tsx:20:47
 
     const sortear = (evento: React.FormEvent<HTMLFormElement>) => {
         evento.preventDefault()
-        if (resultado.has(participanteDaVez)) {
-            setAmigoSecreto(resultado.get(participanteDaVez)!)
-        }
+        if (resultado.has(participanteDaVez)) {}
     }
 
killedBy: na pagina de sorteio o amigo secreto é exibido quando solicitado
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  heading:

  Name "Quem vai tirar o papelzinho?":
  <h2 />

[Killed] ArrowFunction
src/paginas/Sorteio.tsx:35:31
                     id="participanteDavez"
                     placeholder="Selecione o seu nome"
                     value={participanteDaVez}
-                    onChange={evento => setParticipanteDaVez(evento.target.value)}
+                    onChange={() => undefined}
                 >
                     <option>Selecione seu nome</option>
killedBy: na pagina de sorteio o amigo secreto é exibido quando solicitado
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  heading:

  Name "Quem vai tirar o papelzinho?":
  <h2 />

[Killed] ArrowFunction
src/paginas/Sorteio.tsx:38:40
                     onChange={evento => setParticipanteDaVez(evento.target.value)}
                 >
                     <option>Selecione seu nome</option>
-                    {participantes.map(participante => <option key={participante}>{participante}</option>)}
+                    {participantes.map(() => undefined)}
                 </select>
                 <p>Clique em em sortear para ver quem é seu amigo secreto!</p>
killedBy: na pagina de sorteio todos os participantes podem exibir o seu amigo secreto
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 4
Received length: 1
Received array:  [<option>Selecione seu nome</option>]

[Killed] ConditionalExpression
src/paginas/Sorteio.tsx:43:14
                 <p>Clique em em sortear para ver quem é seu amigo secreto!</p>
                 <button className="botao-sortear">Sortear</button>
             </form>
-            {amigoScreto && <p className="resultado" role="alert">{amigoScreto}</p>}
+            {false}
             <footer className="sorteio">
                 <img src="/imagens/aviao.png" className="aviao" alt="Um desenho de um avião de papel" />
killedBy: na pagina de sorteio o amigo secreto é exibido quando solicitado
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  heading:

  Name "Quem vai tirar o papelzinho?":
  <h2 />

[Killed] LogicalOperator
src/paginas/Sorteio.tsx:43:14
                 <p>Clique em em sortear para ver quem é seu amigo secreto!</p>
                 <button className="botao-sortear">Sortear</button>
             </form>
-            {amigoScreto && <p className="resultado" role="alert">{amigoScreto}</p>}
+            {amigoScreto || <p className="resultado" role="alert">{amigoScreto}</p>}
             <footer className="sorteio">
                 <img src="/imagens/aviao.png" className="aviao" alt="Um desenho de um avião de papel" />
killedBy: na pagina de sorteio o amigo secreto é exibido quando solicitado
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  heading:

  Name "Quem vai tirar o papelzinho?":
  <h2 />
