[Survived] StringLiteral
src/state/atom.ts:4:10
 import { atom } from "recoil";
 
 export const listaParticipantesState = atom<string[]>({
-    key: 'listaParticipantesState',
+    key: "",
     default: []
 })

[Killed] ArrayDeclaration
src/state/atom.ts:5:14
 
 export const listaParticipantesState = atom<string[]>({
     key: 'listaParticipantesState',
-    default: []
+    default: ["Stryker was here"]
 })
 
killedBy: a pagina de configuracao deve ser renderizada corretamente
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `a pagina de configuracao deve ser renderizada corretamente 1`

- Snapshot  - 1
+ Received  + 5

@@ -21,11 +21,15 @@

[Killed] StringLiteral
src/state/atom.ts:14:10
 })
 
 export const erroState = atom<string>({
-    key: 'erroState',
+    key: "",
     default: ''
 })
killedBy: o comportamento do Formulario.tsx a mensagem de erro deve sumir após os timers
statusReason: Error: expect(received).toBeNull()

Received: <p class="alerta erro" role="alert">Nomes duplicados não são permitidos!</p>
