[Survived] EqualityOperator
src/state/helpers/realizarSorteio.ts:7:25
     const  totalDeParticipantes = participantes.length
     const embaralhado = shuffle(participantes)
     const resultado = new Map<string, string>()
-    for (let index = 0; index < totalDeParticipantes; index++) {    
+    for (let index = 0; index <= totalDeParticipantes; index++) {    
         const indiceDoAmigo = index === (totalDeParticipantes - 1) ? 0 : index + 1;
         resultado.set(embaralhado[index], embaralhado[indiceDoAmigo])

[Timeout] UpdateOperator
src/state/helpers/realizarSorteio.ts:7:55
     const  totalDeParticipantes = participantes.length
     const embaralhado = shuffle(participantes)
     const resultado = new Map<string, string>()
-    for (let index = 0; index < totalDeParticipantes; index++) {    
+    for (let index = 0; index < totalDeParticipantes; index--) {    
         const indiceDoAmigo = index === (totalDeParticipantes - 1) ? 0 : index + 1;
         resultado.set(embaralhado[index], embaralhado[indiceDoAmigo])

[Killed] ConditionalExpression
src/state/helpers/realizarSorteio.ts:8:31
     const embaralhado = shuffle(participantes)
     const resultado = new Map<string, string>()
     for (let index = 0; index < totalDeParticipantes; index++) {    
-        const indiceDoAmigo = index === (totalDeParticipantes - 1) ? 0 : index + 1;
+        const indiceDoAmigo = true ? 0 : index + 1;
         resultado.set(embaralhado[index], embaralhado[indiceDoAmigo])
     }
killedBy: dado um sorteio de amigo secreto cada participante não sorteie o próprio nome
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not "Ana"

[Killed] EqualityOperator
src/state/helpers/realizarSorteio.ts:8:31
     const embaralhado = shuffle(participantes)
     const resultado = new Map<string, string>()
     for (let index = 0; index < totalDeParticipantes; index++) {    
-        const indiceDoAmigo = index === (totalDeParticipantes - 1) ? 0 : index + 1;
+        const indiceDoAmigo = index !== totalDeParticipantes - 1 ? 0 : index + 1;
         resultado.set(embaralhado[index], embaralhado[indiceDoAmigo])
     }
killedBy: dado um sorteio de amigo secreto cada participante não sorteie o próprio nome
statusReason: Error: expect(received).not.toEqual(expected) // deep equality

Expected: not "Vinicios"
