[Killed] BlockStatement
src/state/hook/useAdicionarParticipante.ts:8:44
     const setLista = useSetRecoilState(listaParticipantesState)
     const lista = useRecoilValue(listaParticipantesState)
     const setErro = useSetRecoilState(erroState)
-    return (nomeDoParticipante: string) => {
-        if (lista.includes(nomeDoParticipante)) {
-            setErro('Nomes duplicados não são permitidos!')
-            setTimeout(() => {
-                setErro("")
-            }, 5000)
-            return
-        }
-        return setLista(listaAtual => [...listaAtual, nomeDoParticipante])
-    }
+    return (nomeDoParticipante: string) => {}
 }
killedBy: o comportamento do Formulario.tsx nomes duplicados não podem ser adicionados na lista
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  textbox:

  Name "":
  <input

[Killed] ConditionalExpression
src/state/hook/useAdicionarParticipante.ts:9:13
     const lista = useRecoilValue(listaParticipantesState)
     const setErro = useSetRecoilState(erroState)
     return (nomeDoParticipante: string) => {
-        if (lista.includes(nomeDoParticipante)) {
+        if (false) {
             setErro('Nomes duplicados não são permitidos!')
             setTimeout(() => {
killedBy: o comportamento do Formulario.tsx nomes duplicados não podem ser adicionados na lista
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  textbox:

  Name "":
  <input

[Killed] BlockStatement
src/state/hook/useAdicionarParticipante.ts:9:49
     const lista = useRecoilValue(listaParticipantesState)
     const setErro = useSetRecoilState(erroState)
     return (nomeDoParticipante: string) => {
-        if (lista.includes(nomeDoParticipante)) {
-            setErro('Nomes duplicados não são permitidos!')
-            setTimeout(() => {
-                setErro("")
-            }, 5000)
-            return
-        }
+        if (lista.includes(nomeDoParticipante)) {}
         return setLista(listaAtual => [...listaAtual, nomeDoParticipante])
     }
killedBy: o comportamento do Formulario.tsx nomes duplicados não podem ser adicionados na lista
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  textbox:

  Name "":
  <input

[Killed] StringLiteral
src/state/hook/useAdicionarParticipante.ts:10:21
     const setErro = useSetRecoilState(erroState)
     return (nomeDoParticipante: string) => {
         if (lista.includes(nomeDoParticipante)) {
-            setErro('Nomes duplicados não são permitidos!')
+            setErro("")
             setTimeout(() => {
                 setErro("")
killedBy: o comportamento do Formulario.tsx nomes duplicados não podem ser adicionados na lista
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  textbox:

  Name "":
  <input

[Killed] BlockStatement
src/state/hook/useAdicionarParticipante.ts:11:30
     return (nomeDoParticipante: string) => {
         if (lista.includes(nomeDoParticipante)) {
             setErro('Nomes duplicados não são permitidos!')
-            setTimeout(() => {
-                setErro("")
-            }, 5000)
+            setTimeout(() => {}, 5000)
             return
         }
killedBy: o comportamento do Formulario.tsx a mensagem de erro deve sumir após os timers
statusReason: Error: expect(received).toBeNull()

Received: <p class="alerta erro" role="alert">Nomes duplicados não são permitidos!</p>

[Killed] StringLiteral
src/state/hook/useAdicionarParticipante.ts:12:25
         if (lista.includes(nomeDoParticipante)) {
             setErro('Nomes duplicados não são permitidos!')
             setTimeout(() => {
-                setErro("")
+                setErro("Stryker was here!")
             }, 5000)
             return
killedBy: o comportamento do Formulario.tsx a mensagem de erro deve sumir após os timers
statusReason: Error: expect(received).toBeNull()

Received: <p class="alerta erro" role="alert">Stryker was here!</p>

[Killed] ArrayDeclaration
src/state/hook/useAdicionarParticipante.ts:16:39
             }, 5000)
             return
         }
-        return setLista(listaAtual => [...listaAtual, nomeDoParticipante])
+        return setLista(listaAtual => [])
     }
 }
killedBy: o comportamento do Formulario.tsx nomes duplicados não podem ser adicionados na lista
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "alert"

Here are the accessible roles:

  textbox:

  Name "":
  <input
