[Survived] BlockStatement
src/state/hook/useSorteador.ts:9:18
 export const useSorteador = () => {
     const participantes = useListaDeParticipantes()
     const setResultado = useSetRecoilState(resultadoAmigoSecreto)
-    return () => {
-       const resultado = realizarSorteio(participantes)
-        setResultado(resultado)       
-    }
+    return () => {}
 }
